[
  {
    "Session ID": "900332",
    "Title": "Beyond Documents: Implementing Knowledge Graphs in Legal Agents",
    "Description": "Structured Representations are pretty important in the law, where the relationships between clauses, documents, entities, and multiple parties matter. Structured Representation means Structured Context Injection. Better Context, Less Hallucinations. We walk through a couple of case studies of systems that we’ve built in production for legal use-cases - from recursive contractual clause retrieval, to HITL legal reasoning news agents.\r\n\r\nYou'll gain insights into how structured representations significantly improve the effectiveness and reliability of legal agents.\r\n",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Tom Smoker",
    "Companies": "WhyHow.AI",
    "Company Domains": "whyhow.ai",
    "Titles": "Co-Founder"
  },
  {
    "Session ID": "911821",
    "Title": "A2A & MCP: Automating Business Processes with LLMs",
    "Description": "Ever wished your webhooks could think for themselves? Join us to discover how A2A agents can transform passive webhook endpoints into intelligent workflow processors.\r\n\r\nIn this session, we'll show you how to build a system that automatically spawns AI Agents to handle incoming webhooks. \r\n\r\nUsing Google's Agent-to-Agent framework and MCP, you'll learn how to create dynamic AI agents that respond to events, communicate with external services, and make decisions based on content analysis.\r\n\r\nSee the future of workflow automation where webhooks don't just trigger actions—they trigger intelligence!",
    "Session Format": "Workshop",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Damien Murphy",
    "Companies": "Bench Computing",
    "Company Domains": "bench.io",
    "Titles": "Full Stack Developer"
  },
  {
    "Session ID": "913965",
    "Title": "The AI Engineer’s Guide to Raising VC",
    "Description": "A no fluff, all tactics discussion. More AI engineers should build startups, the world needs more software. But there’s a way to raise VC and it’s hard to do it if you’ve never seen it done. We are going to walk through the exact playbook to raise your first round of funding. We will show you real pitch decks, real cold emails and real term sheets so when you go out to raise your first round of funding, you are setup to do it. Every AI Engineer should be equip to start their own company and this session makes sure raising $$$ is not going to be the blocker.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Dani Grant, Chelcie Taylor",
    "Companies": "Jam.dev, Notable Capital",
    "Company Domains": "jam.dev, notablecap.com",
    "Titles": "CEO, Investor"
  },
  {
    "Session ID": "916143",
    "Title": "Make Your AI Agents Remember What They Do!",
    "Description": "Are you ready to give your AI agents a memory upgrade? \r\nJoin us for a hands-on, fast-paced workshop where we explore how memory can transform your agents.\r\n\r\nWhat You'll Do:\r\nSet Up Leading Memory Solutions: Get practical, side-by-side experience with open-source tools including AIUS, Cognee, LangMem, MemGPT, Mem0, and Zep.\r\n\r\nExplore Memory Types: Learn the theory behind agent memory, including long-term, short-term, episodic, semantic, and other memory types.\r\n\r\nRun Experiments: Test how memory improves recall, contextual awareness, and reasoning in autonomous agents.\r\n\r\nCompare Implementations: Get a snapshot of how different solutions implement memory—what’s built-in, what’s flexible, and what’s experimental.\r\n\r\nWhether you’re working on AI copilots, agentic workflows, or research prototypes—this workshop will help you embed real memory into your AI stack.",
    "Session Format": "Workshop",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Mark Bain",
    "Companies": "AIUS Technologies",
    "Company Domains": "gmail.com",
    "Titles": "Founder"
  },
  {
    "Session ID": "927353",
    "Title": "Engineering Better Evals: Scalable LLM Evaluation Pipelines",
    "Description": "As LLM-powered products become more sophisticated, the need for scalable, reliable evaluation pipelines has never been more critical. This session dives deep into advanced LLM evaluation strategies that move beyond toy benchmarks and toward real-world production impact.\r\nWe’ll explore how to architect and implement evaluation pipelines that work across both online and offline environments—reducing dev complexity and accelerating iteration. The session will cover:\r\n\r\n- LLM-as-a-judge frameworks\r\n- Human-in-the-loop evaluation\r\n- How hybrid approaches unlock more robust and nuanced performance assessments\r\n\r\nWe’ll break down technical architectures, share real implementation patterns, and examine trade-offs between evaluation techniques to help engineers make informed choices.\r\nWhether you’re building from scratch or refining existing workflows, this talk offers practical strategies for crafting efficient, scalable, and accurate eval pipelines tailored to custom LLM products.\r\n",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Dat  Ngo",
    "Companies": "Arize",
    "Company Domains": "arize.com",
    "Titles": "Director of Solutions, EMEA"
  },
  {
    "Session ID": "933450",
    "Title": "Code Review for the Age of AI",
    "Description": "Today’s codebases move faster than ever, making human code reviews increasingly challenging. In this quick technical talk, we’ll explore how AI-driven code review technology changes the game, rapidly identifying subtle logic errors, hidden security vulnerabilities, and performance bottlenecks before they ever reach production. Drawing on insights from over millions of real-world pull requests reviewed by Diamond, Graphite’s AI code review agent, you'll learn how teams are achieving faster merges and higher code quality.\r\n\r\nWe'll wrap up with a brief introduction to Diamond, demonstrating how effortlessly it integrates into your GitHub workflows, followed by live demos and Q\\&A with our engineers at the booth.",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Tomas Reimers",
    "Companies": "Graphite",
    "Company Domains": "graphite.com",
    "Titles": "CPO"
  },
  {
    "Session ID": "933453",
    "Title": "Onboarding your robot coworkers: customizing AI code review agents to your team’s style",
    "Description": "It’s not enough that AI can review and understand your code in a vacuum. In order to be effective, AI agents need context around your entire codebase and understand the nuances of the way your team works. This talk will examine technical approaches and best practices for teaching AI tools to enforce highly customized style guides and coding conventions no matter what tech stack you’re working in.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
